"use client";
import { useState } from "react";
import AccordionWithPagenation from "@/app/_components/AccordionWithPagenation";

const Manual = () => {
  const [active, setActive] = useState(0);

  const accordion2 = [
    {
      id: 1,
      question: "০১. ভূমি উন্নয়ন কর নাগরিক নিবন্ধন ফরম",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "faqAnswerImage.png",
    },
    
    {
      id: 2,
      question: "০২. ভূমি উন্নয়ন কর OTP ভেরিফিকেশান ফরম",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "",
    },
    {
      id: 3,
      question: "০৩. নতুন পাসওয়ার্ড নিশ্চিতকরণ ফরম",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "faqAnswerImage.png",
    },
    {
      id: 4,
      question: "০৪. ভূমি উন্নয়ন কর নাগরিক প্রোফাইল সম্পন্নকরন ",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "",
    },
    {
      id: 5,
      question: "০৫. ভূমি উন্নয়ন কর খতিয়ান তথ্য এন্ট্রি ফরম",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "faqAnswerImage.png",
    },
    {
      id: 6,
      question: "০৬. ভূমি উন্নয়ন কর হোল্ডিং তালিকা সমূহ",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "",
    },
    {
      id: 7,
      question: "০৭. ভূমি উন্নয়ন কর আপত্তি দাখিল",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "faqAnswerImage.png",
    },
    {
      id: 8,
      question: "০৮. ভূমি উন্নয়ন কর অনলাইন পেমেন্ট",
      answer:
        "প্রথমে www.ldtax.gov.bd ওয়েব সাইটে ভিজিট করে নাগরিক কর্নার মেনুতে ক্লিক করুন। নতুন নিবন্ধন করতে নিবন্ধন মেন্যুতে ক্লিক করে নাগরিকের মোবাইল নম্বর, জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ প্রদান করে “পরবর্তী পদক্ষেপ” বাটনে ক্লিক করুন ।",
      attachment: "",
    },
  ];
  return (
    <>
      <div className="w-full">
        <div className="bg-white p-3 lg:px-12">
          <div>
            <div className="mt-5">
              
              {active == 0 && <AccordionWithPagenation items={accordion2} />}
            </div>
          </div>
        </div>
      </div>
    </>
  );
};

export default Manual;
